<a href="https://colab.research.google.com/github/masonnystrom/Interview-questions/blob/master/Question1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

You are given the following dataset, containing information on baby names from the U.S. Social Security Administration.



Using the dataset, write code to find the following:

* Number of unique names across the dataset, split by both # of unique male/female names
* Top 10 most popular male and female names, along with their associated counts
* The top 10 most trending names (% growth) from 2010+, with an associated plot to show the relative growth between names

In [4]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
baby_names = pd.read_csv("https://raw.githubusercontent.com/erood/interviewqs.com_code_snippets/master/Datasets/ddi_baby_names.csv")
print(baby_names.shape)
baby_names.head()

(1957046, 4)

   year       name gender  count
0  1880       Mary      F   7065
1  1880       Anna      F   2604
2  1880       Emma      F   2003
3  1880  Elizabeth      F   1939
4  1880     Minnie      F   1746

In [54]:
baby_names.nunique()

year        139
name      98400
gender        2
count     13720
dtype: int64

In [0]:
male = baby_names[baby_names['gender'] == 'M']
female = baby_names[baby_names['gender'] == 'F']

In [62]:
print(male['name'].nunique())
print(female['name'].nunique())

41475
67698

In [46]:
male['name'].value_counts()[:10]

Allan        139
Oscar        139
Hugo         139
Delbert      139
Lafayette    139
August       139
Adam         139
Ben          139
David        139
King         139
Name: name, dtype: int64

In [47]:
female['name'].value_counts()[:10]

Margie       139
Daisy        139
Elizabeth    139
Muriel       139
Reba         139
Polly        139
Vina         139
Susan        139
Minerva      139
Molly        139
Name: name, dtype: int64

In [63]:
male[['name', 'count']].sort_values(by='count', ascending=False)[:10]

           name  count
437169    James  94757
544630  Michael  92704
437170   Robert  91640
533165  Michael  90656
556204  Michael  90517
447478    James  88584
510812  Michael  88528
521887  Michael  88327
437171     John  88319
427047    James  87436

In [66]:
female[['name','count']].sort_values(by='count', ascending=False)[:10]

         name  count
431066  Linda  99689
441437  Linda  96211
451678  Linda  91016
461947  Linda  80431
180209   Mary  73985
472250  Linda  73978
212465   Mary  73534
191066   Mary  72173
431067   Mary  71687
201822   Mary  71638

In [0]:
# plotting
import plotly.express as px